Revit 2027 API
ParameterTypeId.FabricationPartLength Property
 "Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartLength { get; }
Public Shared ReadOnly Property FabricationPartLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartLength {
	ForgeTypeId^ get ();
}
static member FabricationPartLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace